Repository: soberlemur/autopo
Catalog: autopo-i18n/po/*.po
Languages: es

source: Model:
es: Modelo:

source: AI Model to use
es: Modelo de IA a utilizar

source: API key:
es: Clave API:

source: Temperature:
es: Temperatura:

source: Higher values make the output more random, lower values make it more deterministic
es: Valores más altos hacen la salida más aleatoria, valores más bajos la hacen más determinista

source: Clear
es: Limpiar

source: Clear Anthropic settings
es: Borrar configuración de Anthropic

source: Base URL:
es: URL base:

source: Clear Ollama settings
es: Borrar configuración de Ollama

source: There was an error retrieving recently used projects
es: Hubo un error al recuperar los proyectos utilizados recientemente

source: An error occurred loading .po file '{0}'
es: Ocurrió un error al cargar el archivo .po '{0}'

source: An error occurred loading .pot file '{0}'
es: Ha ocurrido un error al cargar el archivo .pot '{0}'

source: An error occurred updating .po file '{0}'
es: Ocurrió un error al actualizar el archivo .po '{0}'

source: An error adding .po file '{0}' to the project
es: Un error al agregar el archivo .po '{0}' al proyecto

source: An error occurred saving .po file to '{0}'
es: Ocurrió un error al guardar el archivo .po en '{0}'

source: An error occurred loading project file '{0}'
es: Ha ocurrido un error al cargar el archivo de proyecto '{0}'

source: An error occurred saving project to '{0}'
es: Ocurrió un error al guardar el proyecto en '{0}'

source: Loading .po file {}
es: Cargando archivo .po {}

source: Unable to find or detect a valid locale
es: No se puede encontrar o detectar una configuración regional válida

source: File {} loaded
es: Archivo {} cargado

source: Updating po file {} from template {}
es: Actualizando archivo po {} desde plantilla {}

source: Po file {} updated
es: Archivo Po {} actualizado

source: Cannot update file {} because it is not loaded yet
es: No se puede actualizar el archivo {} porque aún no está cargado

source: Loading .pot file {}
es: Cargando archivo .pot {}

source: Saving po file {}
es: Guardando archivo po {}

source: File {} saved
es: Archivo {} guardado

source: Loading project file {}
es: Cargando archivo de proyecto {}

source: Creating project descriptor file '{}'
es: Creando archivo descriptor de proyecto '{}'

source: Found template file '{}'
es: Se encontró el archivo de plantilla '{}'

source: Skipping directory '{}'
es: Omitiendo directorio '{}'

source: Project {} loaded
es: Proyecto {} cargado

source: Saving project file {}
es: Guardando archivo de proyecto {}

source: Trying to guess locale from filename '{}'
es: Intentando adivinar la configuración regional del nombre de archivo '{}'

source: Trying to guess locale from file content with AI
es: Intentando adivinar la configuración regional del contenido del archivo con IA

source: Trying to guess locale from '{}'
es: Intentando adivinar la configuración regional desde '{}'

source: Invalid locale: {}
es: Configuración regional no válida: {}

source: Total token used {0}
es: Total de tokens usados {0}

source: An error occurred while translating with AI
es: Ha ocurrido un error al traducir con IA

source: Total token used {0} (input: {1}, output: {2})
es: Total de tokens usados {0} (entrada: {1}, salida: {2})

source: Invalid finish reason: {0}
es: Razón de finalización no válida: {0}

source: An error occurred while assessing with AI
es: Ocurrió un error al evaluar con IA

source: An error occurred while assessing a translation with AI
es: Ocurrió un error al evaluar una traducción con IA

source: Inconsistent trailing spaces between original and translation
es: Espacios finales inconsistentes entre el original y la traducción

source: Inconsistent trailing linefeed between original and translation
es: Salto de línea final inconsistente entre el original y la traducción

source: Translated string should be included in ¡ and !
es: La cadena traducida debe estar incluida entre ¡ y !

source: Translated string should not be included in ¡ and !
es: La cadena traducida no debe incluirse entre ¡ y !

source: Inconsistent question mark between original and translation
es: Signo de interrogación inconsistente entre el original y la traducción

source: Inconsistent full stop ending between original and translation
es: Finalización inconsistente con punto final entre el original y la traducción

source: Inconsistent capitalization of the first letter between the original and translation
es: Uso inconsistente de mayúsculas en la primera letra entre el original y la traducción

source: Inconsistent number of placeholders (%s, %d, %c, %x, %b, %f, {0}...) between original and translation
es: Número inconsistente de marcadores de posición (%s, %d, %c, %x, %b, %f, {0}...) entre el original y la traducción

source: Translated string should be included in ¿ and ?
es: La cadena traducida debe estar incluida entre ¿ y ?

source: Translated string should not be included in ¿ and ?
es: La cadena traducida no debe incluir ¿ y ?

source: Suspicious lowercase of the first letter
es: Sospechosa minúscula de la primera letra

source: Inconsistent leading spaces between original and translation
es: Espacios iniciales inconsistentes entre el original y la traducción

source: Inconsistent exclamation mark between original and translation
es: Signo de exclamación inconsistente entre el original y la traducción

source: Suspicious quotes inconsistency between original and translation
es: Inconsistencia sospechosa de comillas entre el original y la traducción

source: Nord dark
es: Nord oscuro

source: Light
es: Claro

source: Cupertino dark
es: Cupertino oscuro

source: Cupertino light
es: Cupertino claro

source: Dark
es: Oscuro

source: Nord light
es: Luz del Norte

source: Clear Google Gemini settings
es: Borrar configuración de Google Gemini

source: Translating...
es: Traduciendo...

source: Updating...
es: Actualizando...

source: Adding .po to the project...
es: Agregando .po al proyecto...

source: Validating...
es: Validando...

source: System default
es: Predeterminado del sistema

source: First available
es: Primera disponible

source: Persistent application settings deleted
es: Configuración de aplicación persistente eliminada

source: Unable to clear application settings
es: No se pueden borrar la configuración de la aplicación

source: Closing...
es: Cerrando...

source: Unexpected error
es: Error inesperado

source: Unable to open '{}', please copy and paste the url to your browser
es: No se puede abrir '{}', por favor copie y pegue la URL en su navegador

source: General settings
es: Configuración general

source: AI providers
es: Proveedores de IA

source: Settings
es: Configuración

source: Language:
es: Idioma:

source: Set your preferred language (restart needed)
es: Establece tu idioma preferido (se requiere reiniciar)

source: Theme:
es: Tema:

source: Set the application theme
es: Establecer el tema de la aplicación

source: Font size:
es: Tamaño de fuente:

source: Set the application font size
es: Establecer el tamaño de fuente de la aplicación

source: Translations AI provider:
es: Proveedor de IA para traducciones:

source: Set the AI provider for translations
es: Establecer el proveedor de IA para traducciones

source: Validations AI provider:
es: Proveedor de validación de IA:

source: Set the AI provider used for validation
es: Establecer el proveedor de IA utilizado para validación

source: Batch size:
es: Tamaño de lote:

source: Set the number of entries to translate with the AI batch translation
es: Establece el número de entradas para traducir con la traducción por lotes de IA

source: Discard modification
es: Descartar modificación

source: Yes
es: Sí

source: Close
es: Cerrar

source: Template
es: Plantilla

source: Translations
es: Traducciones

source: Expand
es: Expandir

source: Collapse
es: Contraer

source: Edit project
es: Editar proyecto

source: Select template
es: Seleccionar plantilla

source: Add translation
es: Añadir traducción

source: Save a .po translation file
es: Guardar un archivo de traducción .po

source: The file {0} already exists
es: El archivo {0} ya existe

source: The file {0} is not inside the current project directory
es: El archivo {0} no está dentro del directorio del proyecto actual

source: Update all from pot
es: Actualizar todo desde pot

source: Remove obsolete entries from every .po file
es: Eliminar entradas obsoletas de cada archivo .po

source: Select a template
es: Seleccionar una plantilla

source: Edit
es: Editar

source: Save
es: Guardar

source: Remove obsolete entries
es: Eliminar entradas obsoletas

source: No obsolete entries to remove
es: No hay entradas obsoletas para eliminar

source: Obsolete entries removed
es: Entradas obsoletas eliminadas

source: Select the language for the translation
es: Seleccione el idioma para la traducción

source: Search
es: Buscar

source: Cancel
es: Cancelar

source: Add
es: Añadir

source: Removes all the log messages
es: Elimina todos los mensajes de registro

source: _Clear
es: _Limpiar

source: _Save
es: _Guardar

source: Copy
es: Copiar

source: Select all
es: Seleccionar todo

source: Save log
es: Guardar registro

source: Select where to save the log file
es: Seleccione dónde guardar el archivo de registro

source: Logs
es: Registros

source: No translation selected
es: Ninguna traducción seleccionada

source: AI Translate
es: Traducción IA

source: AI Validate
es: Validar IA

source: Assessment
es: Evaluación

source: Comments
es: Comentarios

source: Extracted comments
es: Comentarios extraídos

source: Formats
es: Formatos

source: Source reference
es: Referencia de origen

source: Add a project description to give the AI model more context and improve translations accuracy
es: Agregue una descripción del proyecto para proporcionar más contexto al modelo de IA y mejorar la precisión de las traducciones

source: The project must have a target locale to translate to
es: El proyecto debe tener una configuración regional de destino para traducir

source: Unable to find a usable translation AI model
es: No se pudo encontrar un modelo de IA de traducción utilizable

source: Rate:
es: Valorar:

source: Feedback
es: Comentarios

source: Suggested replacement
es: Reemplazo sugerido

source: Accept suggestion
es: Aceptar sugerencia

source: Rate: {0}
es: Votar: {0}

source: Translation
es: Traducción

source: Source
es: Fuente

source: Rate
es: Valorar

source: Clear selected translations
es: Borrar traducciones seleccionadas

source: Translate selected with AI
es: Traducir seleccionado con IA

source: Validate selected with AI
es: Validar seleccionado con IA

source: Translated {0} out of {1}
es: Traducido {0} de {1}

source: _Update from pot
es: Act_ualizar desde pot

source: _Batch AI translation
es: _Traducción por lotes con IA

source: Translate a batch of untranslated entries with the selected AI model (The batch size is defined in the settings)
es: Traducir un lote de entradas sin traducir con el modelo de IA seleccionado (El tamaño del lote está definido en la configuración)

source: Exit
es: Salir

source: Project
es: Proyecto

source: Open
es: Abrir

source: Select the project directory
es: Selecciona el directorio del proyecto

source: Recents
es: Recientes

source: Clear recents
es: Limpiar recientes

source: _File
es: A_rchivo

source: _Edit
es: _Editar

source: About
es: Acerca de

source: _Help
es: _Ayuda

source: Project name:
es: Nombre del proyecto:

source: This description will be provided to the AI model to improve translation accuracy by giving it context. Example: 'UI components for an e-commerce website that sells avocados.
es: Esta descripción se proporcionará al modelo de IA para mejorar la precisión de la traducción dándole contexto. Ejemplo: 'Componentes de interfaz de usuario para un sitio web de comercio electrónico que vende aguacates.

source: Please enter a valid project name
es: Por favor, introduzca un nombre de proyecto válido

source: Project settings
es: Configuración del proyecto

source: Environment
es: Entorno

source: Vendor: %s
es: Proveedor: %s

source: Java runtime path: %s
es: Ruta de tiempo de ejecución de Java: %s

source: JavaFX runtime version: %s
es: Versión de tiempo de ejecución de JavaFX: %s

source: Copy to clipboard
es: Copiar al portapapeles

source: Support
es: Soporte

source: Bug and feature requests
es: Solicitudes de errores y funciones

source: Fork me on GitHub
es: Hazme un fork en GitHub

source: Open application logs
es: Abrir registros de la aplicación

source: File {0} saved
es: Archivo {0} guardado

source: File {0} loaded
es: Archivo {0} cargado

source: Open logs
es: Abrir registros

source: Error saving content to file {}
es: Error guardando contenido en el archivo {}

source: Error saving content to clipboard
es: Error al guardar el contenido en el portapapeles

source: Clear Azure Open AI settings
es: Borrar la configuración de Azure Open AI

source: Clear OpenAI settings
es: Borrar configuración de OpenAI

source: There are modified Po files, proceeding will discard the modifications, do you want to proceed?
es: ¿Hay archivos Po modificados, al continuar se descartarán las modificaciones, ¿desea proceder?

source: modified
es: modificado

source: There are no untranslated entries
es: No hay entradas sin traducir
